Steady_Vortex/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
3280
(
0.999828557115
0.999819772752
0.999829545438
0.999851987851
0.999842966665
0.999854758216
0.999820799086
0.999835433887
...
)
;

boundaryField
{
    Bottom
    {
        type            cyclic;
    }
    Left
    {
        type            cyclic;
    }
    Right
    {
        type            cyclic;
    }
    Top
    {
        type            cyclic;
    }
    FrontandBack
    {
        type            empty;
    }
}


// ************************************************************************* //
