Steady_Vortex/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];


internalField   nonuniform List<scalar> 
3280
(
0.999951013319
0.999948503186
0.999951295731
0.999957708579
0.999955130816
0.999958500195
0.999948796462
0.999952978347
...
)
;

boundaryField
{
    Bottom
    {
        type            cyclic;
    }
    Left
    {
        type            cyclic;
    }
    Right
    {
        type            cyclic;
    }
    Top
    {
        type            cyclic;
    }
    FrontandBack
    {
        type            empty;
    }
}


// ************************************************************************* //
